---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementDesignOptionFilter
source: html/4ecc7a39-be47-11d6-4c32-f5337d31ecba.htm
---
# ElementDesignOptionFilter Members

Constructs a new instance of a filter to match elements contained within a particular design option.